joristork/robots/jobot_in_c/microchip_extras/h/p18f67k90.h
extern volatile far  unsigned char       CM2CON1;
extern volatile far  union {
  struct {
    unsigned CCH:2;
    unsigned CREF:1;
    unsigned EVPOL:2;
    unsigned CPOL:1;
    unsigned COE:1;
    unsigned CON:1;
  };
  struct {
    unsigned CCH0:1;
    unsigned CCH1:1;
    unsigned :1;
    unsigned EVPOL0:1;
    unsigned EVPOL1:1;
  };
} CM2CON1bits;
extern volatile far  unsigned char       T12CON;
extern volatile far  union {
  struct {
    unsigned T12CKPS:2;
    unsigned TMR12ON:1;
    unsigned T12OUTPS:4;
  };
  struct {
    unsigned T12CKPS0:1;
    unsigned T12CKPS1:1;
    unsigned :1;
    unsigned T12OUTPS0:1;
    unsigned T12OUTPS1:1;
    unsigned T12OUTPS2:1;
    unsigned T12OUTPS3:1;
  };
} T12CONbits;
extern volatile far  unsigned char       PR12;
extern volatile far  unsigned char       TMR12;
extern volatile far  unsigned char       T10CON;
extern volatile far  union {
  struct {
    unsigned T10CKPS:2;
    unsigned TMR10ON:1;
    unsigned T10OUTPS:4;
  };
  struct {
    unsigned T10CKPS0:1;
    unsigned T10CKPS1:1;
    unsigned :1;
    unsigned T10OUTPS0:1;
    unsigned T10OUTPS1:1;
    unsigned T10OUTPS2:1;
    unsigned T10OUTPS3:1;
  };
} T10CONbits;
extern volatile far  unsigned char       PR10;
extern volatile far  unsigned char       TMR10;
extern volatile far  unsigned char       T8CON;
extern volatile far  union {
  struct {
    unsigned T8CKPS:2;
    unsigned TMR8ON:1;
    unsigned T8OUTPS:4;
  };
  struct {
    unsigned T8CKPS0:1;
    unsigned T8CKPS1:1;
    unsigned :1;
    unsigned T8OUTPS0:1;
    unsigned T8OUTPS1:1;
    unsigned T8OUTPS2:1;
    unsigned T8OUTPS3:1;
  };
} T8CONbits;
extern volatile far  unsigned char       PR8;
extern volatile far  unsigned char       TMR8;
extern volatile far  unsigned char       T6CON;
extern volatile far  union {
  struct {
    unsigned T6CKPS:2;
    unsigned TMR6ON:1;
    unsigned T6OUTPS:4;
  };
  struct {
    unsigned T6CKPS0:1;
    unsigned T6CKPS1:1;
    unsigned :1;
    unsigned T6OUTPS0:1;
    unsigned T6OUTPS1:1;
    unsigned T6OUTPS2:1;
    unsigned T6OUTPS3:1;
  };
} T6CONbits;
extern volatile far  unsigned char       PR6;
extern volatile far  unsigned char       TMR6;
extern volatile far  unsigned char       T7GCON;
extern volatile far  union {
  struct {
    unsigned T7GSS:2;
    unsigned T7GVAL:1;
    unsigned T7GGO_NOT_T7DONE:1;
    unsigned T7GSPM:1;
    unsigned T7GTM:1;
    unsigned T7GPOL:1;
    unsigned TMR7GE:1;
  };
  struct {
    unsigned T7GSS0:1;
    unsigned T7GSS1:1;
    unsigned :1;
    unsigned T7GGO:1;
  };
  struct {
    unsigned :3;
    unsigned NOT_T7DONE:1;
  };
} T7GCONbits;
extern volatile far  unsigned char       T7CON;
extern volatile far  union {
  struct {
    unsigned TMR7ON:1;
    unsigned RD16:1;
    unsigned NOT_T7SYNC:1;
    unsigned SOSCEN:1;
    unsigned T7CKPS:2;
    unsigned TMR7CS:2;
  };
  struct {
    unsigned :4;
    unsigned T7CKPS0:1;
    unsigned T7CKPS1:1;
    unsigned TMR7CS0:1;
    unsigned TMR7CS1:1;
  };
} T7CONbits;
extern volatile far  unsigned char       TMR7L;
extern volatile far  union {
  struct {
    unsigned TMR7L:8;
  };
  struct {
    unsigned CAL0:1;
    unsigned CAL1:1;
    unsigned CAL2:1;
    unsigned CAL3:1;
    unsigned CAL4:1;
    unsigned CAL5:1;
    unsigned CAL6:1;
    unsigned CAL7:1;
  };
} TMR7Lbits;
extern volatile far  unsigned char       TMR7H;
extern volatile far  unsigned char       CCP10CON;
extern volatile far  union {
  struct {
    unsigned CCP10M:4;
    unsigned DC10B:2;
  };
  struct {
    unsigned CCP10M0:1;
    unsigned CCP10M1:1;
    unsigned CCP10M2:1;
    unsigned CCP10M3:1;
    unsigned DC10B0:1;
    unsigned DC10B1:1;
  };
  struct {
    unsigned :4;
    unsigned CCP10Y:1;
    unsigned CCP10X:1;
  };
} CCP10CONbits;
extern volatile far  unsigned char       CCPR10L;
extern volatile far  unsigned char       CCPR10H;
extern volatile far  unsigned char       CCP9CON;
extern volatile far  union {
  struct {
    unsigned CCP9M:4;
    unsigned DC9B:2;
  };
  struct {
    unsigned CCP9M0:1;
    unsigned CCP9M1:1;
    unsigned CCP9M2:1;
    unsigned CCP9M3:1;
    unsigned DC9B0:1;
    unsigned DC9B1:1;
  };
  struct {
    unsigned :4;
    unsigned CCP9Y:1;
    unsigned CCP9X:1;
  };
} CCP9CONbits;
extern volatile far  unsigned char       CCPR9;
extern volatile far  unsigned char       CCPR9L;
extern volatile far  unsigned char       CCPR9H;
extern volatile far  unsigned char       CCP8CON;
extern volatile far  union {
  struct {
    unsigned CCP8M:4;
    unsigned DC8B:2;
  };
  struct {
    unsigned CCP8M0:1;
    unsigned CCP8M1:1;
    unsigned CCP8M2:1;
    unsigned CCP8M3:1;
    unsigned DC8B0:1;
    unsigned DC8B1:1;
  };
  struct {
    unsigned :4;
    unsigned CCP8Y:1;
    unsigned CCP8X:1;
  };
} CCP8CONbits;
extern volatile far  unsigned char       CCPR8;
extern volatile far  unsigned char       CCPR8L;
extern volatile far  unsigned char       CCPR8H;
extern volatile far  unsigned char       CCP3CON;
extern volatile far  union {
  struct {
    unsigned CCP3M:4;
    unsigned DC3B:2;
    unsigned P3M:2;
  };
  struct {
    unsigned CCP3M0:1;
    unsigned CCP3M1:1;
    unsigned CCP3M2:1;
    unsigned CCP3M3:1;
    unsigned DC3B0:1;
    unsigned DC3B1:1;
    unsigned P3M0:1;
    unsigned P3M1:1;
  };
  struct {
    unsigned :4;
    unsigned CCP3Y:1;
    unsigned CCP3X:1;
  };
} CCP3CONbits;
extern volatile far  unsigned char       CCPR3;
extern volatile far  unsigned char       CCPR3L;
extern volatile far  unsigned char       CCPR3H;
extern volatile far  unsigned char       ECCP3DEL;
extern volatile far  union {
  struct {
    unsigned P3DC:7;
    unsigned P3RSEN:1;
  };
  struct {
    unsigned P3DC0:1;
    unsigned P3DC1:1;
    unsigned P3DC2:1;
    unsigned P3DC3:1;
    unsigned P3DC4:1;
    unsigned P3DC5:1;
    unsigned P3DC6:1;
  };
} ECCP3DELbits;
extern volatile far  unsigned char       PWM3CON;
extern volatile far  union {
  struct {
    unsigned P3DC:7;
    unsigned P3RSEN:1;
  };
  struct {
    unsigned P3DC0:1;
    unsigned P3DC1:1;
    unsigned P3DC2:1;
    unsigned P3DC3:1;
    unsigned P3DC4:1;
    unsigned P3DC5:1;
    unsigned P3DC6:1;
  };
} PWM3CONbits;
